{
  "bafs":{
    "t": {
      "zh": "企業、會計與財務概論",
      "zh-cn": "企业、会计与财务概论",
      "en": "Business, Accounting, and Financial Studies"
    },
    "d": {
      "zh": "企業、會計與財務概論（BAFS）是香港中學的一門學科，涵蓋商業、會計和金融的原則和實踐。 BAFS是一門綜合學科，融合了不同商業相關學科的知識和技能。它旨在幫助學生廣泛了解企業的運作方式、財務資訊的記錄和分析方式以及財務決策的製定方式。以下是BAFS三個主要組成部分的細分：\n\n * **商業**：本部分涵蓋商業組織、管理、行銷和營運等主題，旨在幫助學生對企業的結構和運作方式建立基礎理解。 \n\n* **會計**：本部分重點介紹會計的原則和實踐，包括記錄財務交易、編制財務報表（例如損益表和資產負債表）以及分析財務資料。 \n\n* **金融研究**：本部分涵蓋與金融相關的主題，例如金融市場、投資和風險管理。它旨在幫助學生掌握必要的知識和技能，以便做出明智的財務決策。 \n\n在香港，商業財務與金融學課程通常作為高中（中四至中六）的選修科目。對於有志從事商業、會計、金融或相關領域的學生來說，這是一個熱門的選擇。",
      "zh-cn": "企业、会计与财务概论（BAFS）是香港中学的一门学科，函盖商业、会计和金融的原则和实践。 BAFS是一门综合学科，融合了不同商业相关学科的知识和技能。它旨在帮助学生广泛了解企业的运作方式、财务信息的记录和分析方式以及财务决策的制定方式。以下是BAFS三个主要组成部分的细分：\n\n * **商业**：本部分函盖商业组织、管理、行销和营运等主题，旨在帮助学生对企业的结构和运作方式创建基础理解。 \n\n* **会计**：本部分重点介绍会计的原则和实践，包括记录财务交易、编制财务报表（例如损益表和资产负债表）以及分析财务数据。 \n\n* **金融研究**：本部分函盖与金融相关的主题，例如金融市场、投资和风险管理。它旨在帮助学生掌握必要的知识和技能，以便做出明智的财务决策。 \n\n在香港，商业财务与金融学课程通常作为高中（中四至中六）的选修科目。对于有志从事商业、会计、金融或相关领域的学生来说，这是一个热门的选择。",
      "en": "BAFS is a secondary school subject in Hong Kong that covers the principles and practices of business, accounting, and finance. BAFS is an integrated subject that combines knowledge and skills from different business-related disciplines. It is designed to provide students with a broad understanding of how businesses operate, how financial information is recorded and analyzed, and how financial decisions are made. Here's a breakdown of the three main components of BAFS:\n\n *   **Business:** This section covers topics such as business organization, management, marketing, and operations. It aims to provide students with a foundational understanding of how businesses are structured and function.\n\n*   **Accounting:** This section focuses on the principles and practices of accounting, including recording financial transactions, preparing financial statements (such as the income statement and balance sheet), and analyzing financial data.\n\n*   **Financial Studies:** This section covers topics related to finance, such as financial markets, investment, and risk management. It aims to equip students with the knowledge and skills to make informed financial decisions.\n\nBAFS is often taken as an elective subject in the senior secondary level (Form 4 to Form 6) in Hong Kong. It is a popular choice for students who are interested in pursuing careers in business, accounting, finance, or related fields."
    }
  },
  "bio":{
    "t": {
      "zh": "生物",
      "zh-cn": "生物",
      "en": "Biology"
    },
    "d": {
      "zh": "DSE **生物** 科目是香港中學文憑 （HKDSE） 考試科學教育學習領域的一部分，探索生物體的世界及其重要過程。它鼓勵學生發展科學思維、分析數據並做出與生物學相關的明智決定。該課程涵蓋細胞生物學、遺傳學、進化以及生物體與其環境之間的關係等主題。 DSE生物科目的關鍵方面：\n\n* **課程結構：** 該科目分為必修和選修部分。必修部分側重於基本的生物學概念，而選修部分則允許學生更深入地研究人類生理學或應用生態學等專業領域。\n\n* **科學探究：** 學生學習設計和進行實驗、分析數據並得出結論，為科學方法打下堅實的基礎。*跨學科聯繫*課程強調科學、技術、社會和環境的相互聯繫，突出生物知識的實際應用。價值觀和態度：鼓勵學生培養積極的價值觀和態度，例如尊重生物和對環境保護的責任感。學習目標：\n \n\n* **概念理解** 學生全面理解關鍵的生物學概念，包括細胞結構和功能、遺傳學、進化以及生物體與其環境之間的相互作用。 \n \n* **程式知識：**他們培養設計和進行科學調查、分析數據以及得出有效結論的能力。\n \n* **應用和評估：** 學生學習應用他們的生物學知識來理解當代問題並做出明智的判斷。與科學、技術、社會和環境相關的決策。\n \n* **積極的態度：** 他們培養了對生命多樣性的欣賞，尊重所有生物，以及對環境保護的責任感。 \n學生對關鍵的生物概念有了全面的理解，包括細胞結構和功能、遺傳學、進化以及生物體與其環境之間的相互作用。 \n \n* **程式知識：他們培養了設計和進行科學調查的能力，分析數據，並得出有效的結論。\n \n* **應用和評估：** 學生學習應用他們的生物學知識來理解他們培養了對生命多樣性的欣賞，尊重所有生物，以及對環境保護的責任感。",
      "zh-cn": "DSE **生物** 科目是香港中学文凭 （HKDSE） 考试科学教育学习领域的一部分，探索生物体的世界及其重要过程。它鼓励学生发展科学思维、分析数据并做出与生物学相关的明智决定。该课程函盖细胞生物学、遗传学、进化以及生物体与其环境之间的关系等主题。 DSE生物科目的关键方面：\n\n* **课程结构：** 该科目分为必修和选修部分。必修部分侧重于基本的生物学概念，而选修部分则允许学生更深入地研究人类生理学或应用生态学等专业领域。\n\n* **科学探究：** 学生学习设计和进行实验、分析数据并得出结论，为科学方法打下坚实的基础。*跨学科联系*课程强调科学、技术、社会和环境的相互联系，突出生物知识的实际应用。价值观和态度：鼓励学生培养积极的价值观和态度，例如尊重生物和对环境保护的责任感。学习目标：\n \n\n* **概念理解** 学生全面理解关键的生物学概念，包括细胞结构和功能、遗传学、进化以及生物体与其环境之间的相互作用。 \n \n* **程序知识：**他们培养设计和进行科学调查、分析数据以及得出有效结论的能力。\n \n* **应用和评估：** 学生学习应用他们的生物学知识来理解当代问题并做出明智的判断。与科学、技术、社会和环境相关的决策。\n \n* **积极的态度：** 他们培养了对生命多样性的欣赏，尊重所有生物，以及对环境保护的责任感。 \n学生对关键的生物概念有了全面的理解，包括细胞结构和功能、遗传学、进化以及生物体与其环境之间的相互作用。 \n \n* **程序知识：他们培养了设计和进行科学调查的能力，分析数据，并得出有效的结论。\n \n* **应用和评估：** 学生学习应用他们的生物学知识来理解他们培养了对生命多样性的欣赏，尊重所有生物，以及对环境保护的责任感。",
      "en": "The DSE **Biology** subject, part of the Science Education learning area in the Hong Kong Diploma of Secondary Education (HKDSE) exam, explores the world of living organisms and their vital processes. It encourages students to develop scientific thinking, analyze data, and make informed decisions related to biology. The curriculum covers topics like cell biology, genetics, evolution, and the relationship between organisms and their environment.  Key aspects of the DSE Biology subject:\n\n*   **Curriculum Structure:** The subject is divided into compulsory and elective parts. The compulsory part focuses on fundamental biological concepts, while the elective part allows students to delve deeper into specialized areas like human physiology or applied ecology. \n    \n*   **Scientific Inquiry:** Students learn to design and conduct experiments, analyze data, and draw conclusions, fostering a strong foundation in scientific methodology. \n    \n*   **Interdisciplinary Connections:** The curriculum emphasizes the interconnections of science, technology, society, and the environment, highlighting the real-world applications of biological knowledge. \n    \n*   **Values and Attitudes:** Students are encouraged to develop positive values and attitudes, such as respect for living things and a sense of responsibility for environmental conservation. \n    \n*   Learning Objectives:\n    \n\n*   **Conceptual Understanding:** Students gain a comprehensive understanding of key biological concepts, including cell structure and function, genetics, evolution, and the interactions between organisms and their environment.\n    \n*   **Procedural Knowledge:** They develop the ability to design and carry out scientific investigations, analyze data, and draw valid conclusions.\n    \n*   **Application and Evaluation:** Students learn to apply their biological knowledge to understand contemporary issues and make informed decisions related to science, technology, society, and the environment.\n    \n*   **Positive Attitudes:** They cultivate an appreciation for the diversity of life, respect for all living things, and a sense of responsibility for environmental conservation"
    }
  },
  "chem":{
    "t": {
      "zh": "化學",
      "zh-cn": "化学",
      "en": "Chemistry"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）*化學*科是科學教育學習領域內的甲類選修科目，旨在探討宏觀化學現象與原子、分子和離子等微觀世界之間的連結。學生將培養科學和邏輯思考能力，學會運用化學知識解決問題，並探討化學對社會、經濟和環境的影響。 \n\nDSE 化學科目的主要內容:\n\n**課程設定**:\n\n本課程涵蓋微觀世界、金屬、酸鹼、化石燃料和化學反應等主題。 \n\n**評估**:\n\n評估學生回憶和理解化學知識、使用儀器、進行實驗、分析數據和運用知識的能力。 \n\n**實踐技能**:\n\n本科目強調動手實驗，包括使用儀器、進行實驗和進行精確觀察。 \n\n**問題解決**:\n\n學生將學習分析資訊、解釋數據和解決與化學相關的問題。 \n\n**實際應用**:\n\n本課程探討化學與日常生活、社會和環境的相關性。 \n\n**科學態度**：\n\n鼓勵學生對科學和終身學習建立正面的價值觀和態度。 \n\n本質上，DSE 化學科目旨在為學生打下堅實的化學基礎，培養他們的科學思維能力，為他們進一步學習或在相關領域工作做好準備。",
      "zh-cn": "香港中学文凭考试（HKDSE）*化学*科是科学教育学习领域内的甲类选修科目，旨在探讨宏观化学现象与原子、分子和离子等微观世界之间的链接。学生将培养科学和逻辑思考能力，学会运用化学知识解决问题，并探讨化学对社会、经济和环境的影响。 \n\nDSE 化学科目的主要内容:\n\n**课程设置**:\n\n本课程函盖微观世界、金属、酸硷、化石燃料和化学反应等主题。 \n\n**评估**:\n\n评估学生回忆和理解化学知识、使用仪器、进行实验、分析数据和运用知识的能力。 \n\n**实践技能**:\n\n本科目强调动手实验，包括使用仪器、进行实验和进行精确观察。 \n\n**问题解决**:\n\n学生将学习分析信息、解释数据和解决与化学相关的问题。 \n\n**实际应用**:\n\n本课程探讨化学与日常生活、社会和环境的相关性。 \n\n**科学态度**：\n\n鼓励学生对科学和终身学习创建正面的价值观和态度。 \n\n本质上，DSE 化学科目旨在为学生打下坚实的化学基础，培养他们的科学思维能力，为他们进一步学习或在相关领域工作做好准备。",
      "en": "The Hong Kong Diploma of Secondary Education (HKDSE) Chemistry subject is a Category A elective within the Science Education learning area. It focuses on understanding the link between macroscopic chemical phenomena and the microscopic world of atoms, molecules, and ions. Students develop scientific and logical thinking skills, learn to apply chemical knowledge to problem-solving, and explore the social, economic, and environmental impact of chemistry.\n\nKey aspects of the DSE Chemistry subject:\n\n**Curriculum**:\n\nThe curriculum covers topics like the microscopic world, metals, acids and bases, fossil fuels, and chemical reactions.\n\n**Assessment**:\n\nStudents are assessed on their ability to recall and understand chemical facts, use apparatus, conduct experiments, analyze data, and apply their knowledge.\n\n**Practical Skills**:\n\nThe subject emphasizes hands-on laboratory work, including using apparatus, performing experiments, and making accurate observations.\n\n**Problem-Solving**:\n\nStudents learn to analyze information, interpret data, and solve problems related to chemistry.\n\n**Real-World Applications**:\n\nThe curriculum explores the relevance of chemistry to daily life, society, and the environment.\n\n**Scientific Attitudes**:\n\nStudents are encouraged to develop positive values and attitudes towards science and lifelong learning.\n\nIn essence, the DSE Chemistry subject aims to equip students with a strong foundation in chemistry, develop their scientific thinking skills, and prepare them for further studies or careers in related fields."
    }
  },
  "chi":{
    "t": {
      "zh": "中文",
      "zh-cn": "中文",
      "en": "Chinese Language"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）*中文*科",
      "zh-cn": "香港中学文凭考试（HKDSE）*中文*科",
      "en": "The Hong Kong Diploma of Secondary Education (HKDSE) Chinese Language subject."
    }
  },
  "chihist":{
    "t": {
      "zh": "中史",
      "zh-cn": "中史",
      "en": "Chinese History"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）*中史*科",
      "zh-cn": "香港中学文凭考试（HKDSE）*中史*科",
      "en": "The Hong Kong Diploma of Secondary Education (HKDSE) Chinese History subject."
    }
  },
  "econ":{
    "t": {
      "zh": "經濟",
      "zh-cn": "经济",
      "en": "Economic"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）*經濟*科",
      "zh-cn": "香港中学文凭考试（HKDSE）*经济*科",
      "en": "The Hong Kong Diploma of Secondary Education (HKDSE) Economic subject."
    }
  },
  "eng":{
    "t": {
      "zh": "英文",
      "zh-cn": "英文",
      "en": "English"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）*英文*科",
      "zh-cn": "香港中学文凭考试（HKDSE）*英文*科",
      "en": "The Hong Kong Diploma of Secondary Education (HKDSE) English subject."
    }
  },
  "geog":{
    "t": {
      "zh": "地理",
      "zh-cn": "地理",
      "en": "Geography"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）*地理*科",
      "zh-cn": "香港中学文凭考试（HKDSE）*地理*科",
      "en": "The Hong Kong Diploma of Secondary Education (HKDSE) Geography subject."
    }
  },
  "ict":{
    "t": {
      "zh": "資訊及通訊科技",
      "zh-cn": "资讯及通讯科技",
      "en": "Information and Communication Technology"
    },
    "d": {
      "zh": "# 资讯及通讯科技\n\n本科目之公开评核乃根据课程发展议会与香港考试及评核局联合编撰的《课程及评核指引（中四至中六）》《资讯及通讯科技》（**ICT**）进行。考生须参阅该指引，以了解评核所需具备的知识、理解能力、通用技能及实践技能。\n\n\n# 评核目标\n\n本评核目标旨在评估考生在下列方面之能力：\n1. 展示对电脑系统种类及组成，以及硬件、软件和数据之间相互关系之知识及理解；\n2. 理解与使用资讯及通讯科技有关之社会、伦理及法律问题；\n3. 有效、合乎道德及有辨别力地使用各类应用软件，以支援资讯处理和解决问题；\n4. 展示对分析问题、运用资讯及通讯科技规划和实施解决方案之方法之理解；及\n5.了解信息素养和利用信息和通信技术共享知识如何影响决策和塑造我们的社会。",
      "zh-cn": "# 资讯及通讯科技\n\n本科目之公开评核乃根据课程发展议会与香港考试及评核局联合编撰的《课程及评核指引（中四至中六）》《资讯及通讯科技》（**ICT**）进行。考生须参阅该指引，以了解评核所需具备的知识、理解能力、通用技能及实践技能。\n\n\n# 评核目标\n\n本评核目标旨在评估考生在下列方面之能力：\n1. 展示对电脑系统种类及组成，以及硬件、软件和数据之间相互关系之知识及理解；\n2. 理解与使用资讯及通讯科技有关之社会、伦理及法律问题；\n3. 有效、合乎道德及有辨别力地使用各类应用软件，以支持资讯处理和解决问题；\n4. 展示对分析问题、运用资讯及通讯科技规划和实施解决方案之方法之理解；及\n5.了解信息素养和利用信息和通信技术共享知识如何影响决策和塑造我们的社会。",
      "en": "# Information and Communication Technology\n\nThe public assessment of this subject is based on the Curriculum and Assessment Guide (Secondary 4─6) Information and Communication Technology (**ICT**) jointly prepared by the Curriculum Development Council and the Hong Kong Examinations and Assessment Authority. Candidates have to refer to the Guide for the knowledge, understanding, generic skills and practical skills they are required to demonstrate in the assessment.\n\n\n# Assessment Objectives\n\nThe objectives of this assessment are to evaluate candidates’ ability to:\n1. demonstrate knowledge and understanding of the range and organisation of computer systems, and the interrelationships among hardware, software and data;\n2. appreciate the social, ethical and legal issues pertaining to the use of information and communication technologies;\n3. use a range of application software effectively, ethically and with discrimination to support information-processing and problem-solving;\n4. demonstrate an understanding of methods for analysing problems, and planning and implementing solutions using information and communication technologies; and\n5. appreciate how information literacy and the sharing of knowledge using information and communication technologies influence decision-making and shape our society."
    }
  },
  "ls":{
    "t": {
      "zh": "通識教育 (舊)",
      "zh-cn": "通识教育 (旧)",
      "en": "Liberal Studies (Old)"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）*通識教育*科",
      "zh-cn": "香港中学文凭考试（HKDSE）*通识教育*科",
      "en": "The Hong Kong Diploma of Secondary Education (HKDSE) *Liberal Studies* subject."
    }
  },
  "m0":{
    "t": {
      "zh": "數學",
      "zh-cn": "数学",
      "en": "Mathematics"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）核心科目: *數學*科",
      "zh-cn": "香港中学文凭考试（HKDSE）核心科目: *数学*科",
      "en": "The Hong Kong Diploma of Secondary Education (HKDSE) Core Subjects: *Mathematics*."
    }
  },
  "m1":{
    "t": {
      "zh": "單元一 (M1)：微積分與統計",
      "zh-cn": "单元一 (M1)：微积分与统计",
      "en": "Module 1: Calculus and Statistics"
    },
    "d": {
      "zh": "DSE 數學延伸部分單元一(M1) 涵蓋了微積分與統計，是香港中學文憑考試數學科的選修部分，適合對數學有濃厚興趣或需要更深入數學知識的學生修讀。 M1主要涵蓋微積分的基礎概念、微積分在不同函數上的應用，以及進階的統計概念，例如機率分布和統計推論。\n\nM1 的主要學習內容包括：\n\n-   **微積分基礎:**\n    \n    學習微分和積分的概念，以及它們在求極值、求曲線下面積等方面的應用。\n    \n-   **指數函數和對數函數:**\n    \n    深入研究指數函數和對數函數的性質，以及它們在實際問題中的應用，例如計算複利和科學研究中的數據分析。\n    \n-   **機率與統計:**\n    \n    學習各種機率分布，如二項分布、常態分布等，以及統計推論的概念，例如假設檢定和信賴區間。\n    \n-   **二項展示:**\n    \n    學習如何利用二項分布來分析和解決與重複試驗相關的問題。\n\nM1的學習有助於學生為大學相關學科(如數學、工程、科學等) 做好準備，同時也培養了學生的邏輯思維和問題解決能力。",
      "zh-cn": "DSE 数学延伸部分单元一(M1) 函盖了微积分与统计，是香港中学文凭考试数学科的选修部分，适合对数学有浓厚兴趣或需要更深入数学知识的学生修读。 M1主要函盖微积分的基础概念、微积分在不同函数上的应用，以及进阶的统计概念，例如几率分布和统计推论。\n\nM1 的主要学习内容包括：\n\n-   **微积分基础:**\n    \n    学习微分和积分的概念，以及它们在求极值、求曲线下面积等方面的应用。\n    \n-   **指数函数和对数函数:**\n    \n    深入研究指数函数和对数函数的性质，以及它们在实际问题中的应用，例如计算复利和科学研究中的数据分析。\n    \n-   **几率与统计:**\n    \n    学习各种几率分布，如二项分布、常态分布等，以及统计推论的概念，例如假设检定和信赖区间。\n    \n-   **二项展示:**\n    \n    学习如何利用二项分布来分析和解决与重复试验相关的问题。\n\nM1的学习有助于学生为大学相关学科(如数学、工程、科学等) 做好准备，同时也培养了学生的逻辑思维和问题解决能力。",
      "en": "DSE Mathematics Extended Part 1 (M1) covers Calculus and Statistics. It is an elective part of the Hong Kong Diploma of Secondary Education Examination Mathematics subject and is suitable for students who have a strong interest in mathematics or need more in-depth mathematical knowledge. M1 mainly covers the basic concepts of calculus, the application of calculus to different functions, and advanced statistical concepts such as probability distribution and statistical inference. \n\nThe main learning content of M1 includes:\n\n- **Basics of Calculus:**\n \n Learn the concepts of differential and integral, and their applications in finding extreme values, finding the area under a curve, etc. \n \n- **Exponential and Logarithmic Functions:**\n \n In-depth study of the properties of exponential and logarithmic functions, and their applications in practical problems, such as calculating compound interest and data analysis in scientific research. \n \n- **Probability and Statistics:**\n \n Learn various probability distributions, such as binomial distribution, normal distribution, etc., as well as the concepts of statistical inference, such as hypothesis testing and confidence intervals. \n \n- **Binomial Presentation:**\n \n Learn how to use the binomial distribution to analyze and solve problems related to repeated experiments. \n\nThe study of M1 helps students prepare for university-related subjects (such as mathematics, engineering, science, etc.), while also cultivating students' logical thinking and problem-solving skills."
    }
  },
  "m2":{
    "t": {
      "zh": "單元二（M2）代數與微積分",
      "zh-cn": "单元二（M2）代数与微积分",
      "en": "Module 2 (M2): Algebra and Calculus"
    },
    "d": {
      "zh": "數學延伸單元二（M2）是香港中學文憑考試（DSE）數學科的延伸部分，著重代數與微積分，目標是深化學生對數學的理解，培養其邏輯思維和解難能力。 M2 的內容包括微積分、矩陣、向量、數學歸納法、二項式定理、三角函數和自然對數等進階數學概念。\n\nM2 的學習內容主要分為以下幾個方面：\n\n-   **基礎知識:** 包含數學歸納法、二項式定理、三角函數等，為進一步學習微積分和代數打下基礎。\n    \n\n-   **微積分:** 涵蓋極限、導數、積分等概念，是微積分的入門。\n    \n\n-   **代數:** 包含矩陣、向量等內容，強調矩陣的運算、線性方程組的解法，以及向量的概念和應用。\n\n修讀M2 的學生通常具有較強的數學能力，並且期望在大學階段或未來職業中，能更深入地運用數學知識，例如工程、物理、計算機科學等領域。\n\n總而言之，M2 是一個內容較為進階的數學課程，旨在培養學生對數學的深層理解和解決複雜問題的能力。",
      "zh-cn": "数学延伸单元二（M2）是香港中学文凭考试（DSE）数学科的延伸部分，着重代数与微积分，目标是深化学生对数学的理解，培养其逻辑思维和解难能力。 M2 的内容包括微积分、矩阵、向量、数学归纳法、二项式定理、三角函数和自然对数等进阶数学概念。\n\nM2 的学习内容主要分为以下几个方面：\n\n-   **基础知识:** 包含数学归纳法、二项式定理、三角函数等，为进一步学习微积分和代数打下基础。\n    \n\n-   **微积分:** 函盖极限、导数、积分等概念，是微积分的入门。\n    \n\n-   **代数:** 包含矩阵、向量等内容，强调矩阵的运算、线性方程组的解法，以及向量的概念和应用。\n\n修读M2 的学生通常具有较强的数学能力，并且期望在大学阶段或未来职业中，能更深入地运用数学知识，例如工程、物理、计算机科学等领域。\n\n总而言之，M2 是一个内容较为进阶的数学课程，旨在培养学生对数学的深层理解和解决复杂问题的能力。",
      "en": "Mathematics Extension Module 2 (M2) is an extension of the Hong Kong Diploma of Secondary Education Examination (DSE) Mathematics subject, focusing on algebra and calculus. The goal is to deepen students' understanding of mathematics and cultivate their logical thinking and problem-solving skills. The content of M2 includes advanced mathematical concepts such as calculus, matrices, vectors, mathematical induction, binomial theorem, trigonometric functions and natural logarithms. \n\nThe learning content of M2 is mainly divided into the following aspects:\n\n- **Basic knowledge:** Includes mathematical induction, binomial theorem, trigonometric functions, etc., laying the foundation for further learning of calculus and algebra. \n \n\n- **Calculus:** Covers concepts such as limits, derivatives, and integrals, and is an introduction to calculus. \n \n\n- **Algebra:** Includes matrices, vectors, etc., emphasizing matrix operations, solutions to linear equations, and the concept and application of vectors. \n\nStudents who take M2 usually have strong mathematical abilities and expect to apply mathematical knowledge more deeply in college or in future careers, such as engineering, physics, computer science and other fields. \n\nIn short, M2 is a more advanced mathematics course designed to cultivate students' deep understanding of mathematics and ability to solve complex problems."
    }
  },
  "phy":{
    "t": {
      "zh": "物理",
      "zh-cn": "物理",
      "en": "Physics"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）物理課程旨在培養學生對基礎物理概念的理解、運用這些概念解決問題的能力，以及對物理應用和意義的認識。課程涵蓋廣泛的主題，包括力學、熱物理、波、電磁學以及核子物理。學生還應透過實驗室工作和調查研究培養實踐技能。 \n\n## 香港中學文憑考試物理課程的主要組成部分包括：\n\n- **核心主題** \n 核心課程涵蓋力學、熱物理、波、電磁學和核物理等各個領域的基本物理概念和原理。 \n- **選修模組** \n 學生從天文學、原子世界、能源和醫學物理等主題中選擇一個或兩個選修模組。 \n- **實務工作** \n 學生參與實驗室工作，包括實驗和調查研究，以培養他們的實踐技能和對科學方法的理解。 \n- **評估** \n 香港中學文憑考試物理考試評估學生對課程的知識和理解、他們應用物理概念的能力以及他們的實踐技能。 \n\n## 香港中學文憑考試物理考試的評估目標：\n\n- 回憶和理解物理事實、概念和原則。 \n- 運用知識解釋現象和解決問題問題。 \n- 了解儀器的使用和實驗方法。 \n- 呈現、分析和解釋資料。 \n- 清晰、有邏輯地傳達訊息。 \n- 了解物理學的應用及其意義。 \n- 評估與物理相關的問題。 \n\n## 培養的技能:\n\n透過HKDSE物理課程，學生將培養一系列技能，包括:\n\n- **知識與理解**：打下堅實的物理概念和原理基礎。 \n- **問題解決**：運用知識解決物理問題。 \n- **實務技能**：進行實驗、進行測量和分析數據。 \n- **溝通技巧**：清晰有效地呈現科學訊息。 \n- **批判性思考**：評估與物理相關的問題並做出明智的判斷。 \n\nHKDSE物理課程旨在為學生打下堅實的物理基礎和相關技能，為他們進一步學習或從事科學工作做好準備和技術。",
      "zh-cn": "香港中学文凭考试（HKDSE）物理课程旨在培养学生对基础物理概念的理解、运用这些概念解决问题的能力，以及对物理学应用和含义的认识。课程涵盖广泛的主题，包括力学、热物理、波、电磁学以及核物理。学生还应通过实验室工作和调查研究培养实践技能。\n\n## 香港中学文凭考试物理课程的主要组成部分包括：\n\n- **核心主题** \n 核心课程涵盖力学、热物理、波、电磁学和核物理等各个领域的基本物理概念和原理。\n- **选修模块** \n 学生从天文学、原子世界、能源和医学物理等主题中选择一个或两个选修模块。\n- **实践工作** \n 学生参与实验室工作，包括实验和调查研究，以培养他们的实践技能和对科学方法的理解。\n- **评估** \n 香港中学文凭考试物理考试评估学生对课程的知识和理解、他们应用物理概念的能力以及他们的实践技能。\n\n## 香港中学文凭考试物理考试的评估目标：\n\n- 回忆和理解物理事实、概念和原理。\n- 运用知识解释现象和解决问题问题。\n- 了解仪器的使用和实验方法。\n- 呈现、分析和解释数据。\n- 清晰、有逻辑地传达信息。\n- 了解物理学的应用及其含义。\n- 评估与物理相关的问题。\n\n## 培养的技能:\n\n通过HKDSE物理课程，学生将培养一系列技能，包括:\n\n- **知识与理解**：打下坚实的物理概念和原理基础。\n- **问题解决**：运用知识解决物理问题。\n- **实践技能**：进行实验、进行测量和分析数据。\n- **沟通技巧**：清晰有效地呈现科学信息。\n- **批判性思维**：评估与物理相关的问题并做出明智的判断。\n\nHKDSE物理课程旨在为学生打下坚实的物理基础和相关技能，为他们进一步学习或从事科学工作做好准备和技术。",
      "en": "The Hong Kong Diploma of Secondary Education (HKDSE) **Physics** curriculum aims to develop students' understanding of fundamental physics concepts, their ability to apply these concepts to solve problems, and their awareness of the applications and implications of physics. The curriculum covers a broad range of topics, including mechanics, thermal physics, waves, electricity and magnetism, and nuclear physics. Students are also expected to develop practical skills through laboratory work and investigative studies.\n\n## Key components of the HKDSE Physics curriculum include:\n\n-   **Core Topics:**    \n    The core curriculum covers fundamental physics concepts and principles across various areas such as mechanics, thermal physics, waves, electricity and magnetism, and nuclear physics.\n-   **Elective Modules:**    \n    Students choose one or two elective modules from a selection including astronomy, atomic world, energy, and medical physics.\n-   **Practical Work:**    \n    Students engage in laboratory work, including experiments and investigative studies, to develop their practical skills and understanding of scientific methodology.\n-   **Assessment:**    \n    The HKDSE Physics examination assesses students' knowledge and understanding of the curriculum, their ability to apply physics concepts, and their practical skills.\n\n## Assessment objectives of HKDSE Physics examination:\n\n-   Recalling and understanding physics facts, concepts, and principles.\n-   Applying knowledge to explain phenomena and solve problems.\n-   Understanding the use of apparatus and experimental methods.\n-   Presenting, analyzing, and interpreting data.\n-   Communicating information clearly and logically.\n-   Understanding the applications of physics and its implications.\n-   Evaluating physics-related issues.\n\n## Skills Developed:\n\nThrough the HKDSE Physics curriculum, students develop a range of skills, including:\n\n-   **Knowledge and Understanding:** Acquiring a solid foundation in physics concepts and principles.\n-   **Problem-Solving:** Applying knowledge to solve physics problems.\n-   **Practical Skills:** Conducting experiments, making measurements, and analyzing data.\n-   **Communication Skills:** Presenting scientific information clearly and effectively.\n-   **Critical Thinking:** Evaluating physics-related issues and making informed judgments.\n\nThe HKDSE Physics curriculum is designed to equip students with a strong foundation in physics and related skills, preparing them for further studies or careers in science and technology."
    }
  },
  "ths":{
    "t": {
      "zh": "旅遊與款待",
      "zh-cn": "旅游与款待",
      "en": "Tourism and Hospitality Studies"
    },
    "d": {
      "zh": "香港中學文憑考試（HKDSE）*旅遊與款待*科",
      "zh-cn": "香港中学文凭考试（HKDSE）*旅游与款待*科",
      "en": "HKDSE Elective Subjects:*Tourism and Hospitality* Studies"
    }
  }
}